realsosy/InfineonRacer/2_src/InfineonRacer_TC23xA/0_Src/4_McHal/Tricore/Multican/Can/IfxMultican_Can.h
/**
 * \file IfxMultican_Can.h
 * \brief MULTICAN CAN details
 * \ingroup IfxLld_Multican
 *
 * \version iLLD_1_0_0_11_0
 * \copyright Copyright (c) 2013 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Multican_Can_Usage How to use the CAN Interface driver?
 * \ingroup IfxLld_Multican
 *
 * The CAN interface driver provides a default configuration for various modes.
 *
 * In the following sections it will be described, how to integrate the driver into the application framework.
 *
 * \section IfxLld_Multican_Can_Preparation Preparation
 * \subsection IfxLld_Multican_Can_Include Include Files
 *
 * Include following header file into your C code:
 * \code
 *     #include <Multican/Can/IfxMultican_Can.h>
 * \endcode
 *
 * \subsection IfxLld_Multican_Can_Variables Variables
 *
 * Declare the CAN handles as global variables in your C code:
 * \code
 *     // CAN handle
 *     IfxMultican_Can can;
 *
 *     // Nodes handles
 *     IfxMultican_Can_Node canSrcNode;
 *     IfxMultican_Can_Node canDstNode;
 *
 *     // Message Object handles
 *     IfxMultican_Can_MsgObj canSrcMsgObj;
 *     IfxMultican_Can_MsgObj canDstMsgObj;
 *
 *     const unsigned id = 0x100;
 * \endcode
 *
 * \subsection IfxLld_Multican_Can_Init Module Initialisation
 *
 * The module initialisation can be done as followed:
 * only module clock is supported for clock selection as of now
 * \code
 *     // create configuration
 *     IfxMultican_Can_Config canConfig;
 *     IfxMultican_Can_initModuleConfig(&canConfig, &MODULE_CAN);
 *
 *     // initialize module
 *     // IfxMultican_Can can; // defined globally
 *     IfxMultican_Can_initModule(&can, &canConfig);
 * \endcode
 *
 * \subsection IfxLld_Multican_Can_InitNode Node Initialisation
 *
 * The Can nodes initialisation can be done as followed:
 *
 * \code
 *     // create CAN node config
 *     IfxMultican_Can_NodeConfig canNodeConfig;
 *     IfxMultican_Can_Node_initConfig(&canNodeConfig, &can);
 *
 *     canNodeConfig.baudrate = 1000000; // 1 MBaud
 *
 *     // Source Node
 *     // IfxMultican_Can_Node canSrcNode; // defined globally
 *     {
 *         canNodeConfig.nodeId = IfxMultican_NodeId_0;
 *         canNodeConfig.rxPin = &IIfxMultican_RXD0B_P20_7_IN;
 *         canNodeConfig.rxPinMode = IfxPort_InputMode_pullUp;
 *         canNodeConfig.txPin = &IfxMultican_TXD0_P20_8_OUT;
 *         canNodeConfig.txPinMode = IfxPort_OutputMode_pushPull;
 *
 *         // initialise the node
 *         IfxMultican_Can_Node_init(&canSrcNode, &canNodeConfig);
 *     }
 *
 *     // Destination Node
 *     // IfxMultican_Can_Node canDstNode; // defined globally
 *     {
 *         canNodeConfig.nodeId = IfxMultican_NodeId_1;
 *         canNodeConfig.rxPin = &IfxMultican_RXD1B_P14_1_IN;
 *         canNodeConfig.rxPinMode = IfxPort_InputMode_pullUp;
 *         canNodeConfig.txPin = &IfxMultican_TXD1_P14_0_OUT;
 *         canNodeConfig.txPinMode = IfxPort_OutputMode_pushPull;
 *
 *         // initialise the node
 *         IfxMultican_Can_Node_init(&canDstNode, &canNodeConfig);
 *     }
 * \endcode
 *
 * \subsection IfxLld_Multican_Can_InitMessageObject Message Object Initialisation
 *
 * The Can message objects initialisation can be done as followed:
 *
 * \code
 *     // IfxMultican_Can_MsgObj canSrcMsgObj; // defined globally
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canSrcNode);
 *
 *  // assigned message object:
 *         canMsgObjConfig.msgObjId = 0;
 *
 *         canMsgObjConfig.messageId = id; // 'id' is defined globally
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_transmit;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = TRUE;
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canSrcMsgObj, &canMsgObjConfig);
 *     }
 *
 *     // IfxMultican_Can_MsgObj canDstMsgObj; // defined globally
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canDstNode);
 *
 *  // assigned message object:
 *         canMsgObjConfig.msgObjId = 1;
 *
 *         canMsgObjConfig.messageId = id;
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_receive;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = TRUE;
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canDstMsgObj, &canMsgObjConfig);
 *     }
 * \endcode
 *
 * The MULTICAN is ready for use now!
 *
 *
 * \section IfxLld_Multican_Can_StandardDataTransfers Single Data Transfers
 *
 * The CAN driver provides simple to use transfer functions
 *
 * Data can be sent by the following way:
 * \code
 *     const unsigned dataLow = 0xC0CAC01A;
 *     const unsigned dataHigh = 0xBA5EBA11;
 *
 *     // Initialise the message strcture
 *     IfxMultican_Message txMsg;
 *     IfxMultican_Message_init(&txMsg, id, dataLow, dataHigh, IfxMultican_DataLengthCode_8);
 *
 *     // Transmit Data
 *     while( IfxMultican_Can_MsgObj_sendMessage(&canSrcMsgObj, &txMsg) == IfxMultican_Status_notSentBusy );
 * \endcode
 *
 * Data can be received by the following way:
 * \code
 *     // Receiving Data
 *
 *     // Initialise the message structure with dummy values, will be replaced by the received values
 *     IfxMultican_Message rxMsg;
 *     IfxMultican_Message_init(&rxMsg, 0xdead, 0xdeadbeef, 0xdeadbeef, IfxMultican_DataLengthCode_8); // start with invalid values
 *
 *     // wait until Multican received a new message
 *     while( !IfxMultican_Can_MsgObj_isRxPending(&canDstMsgObj) );
 *
 *     // read message
 *     IfxMultican_Status readStatus = IfxMultican_Can_MsgObj_readMessage(&canDstMsgObj, &rxMsg);
 *
 *     // if no new data is been received report an error
 *     if( !( readStatus & IfxMultican_Status_newData ) )  {
 *         clib_ver_printf("ERROR: IfxMultican_Can_MsgObj_readMessage returned 0x%04x\n", readStatus);
 *     }
 *     // if a new data is been received but one lost, report the status
 *     if( readStatus == IfxMultican_Status_newDataButOneLost )  {
 *         clib_ver_printf(" IfxMultican_Can_MsgObj_readMessage returned 0x%04x\n", readStatus);
 *     }
 *
 *     // data now available at rxMsg.data[0] and rxMsg.data[1]
 * \endcode
 *
 *
 * \section IfxLld_Multican_Can_FIFOBasedTransfers FIFO based Transfers
 *
 * A transmit and receive FIFO can be enabled during the node configuration by specifing the number of allocated message objects with the canMsgObjConfig.msgObjCount item.
 * and specifying the message object number of first slave object with the canMsgObjConfig.firstSlaveObjId item.
 *
 * Message objects will be allocated to the FIFO in ascending order.
 *
 * Here a configuration example:
 * \code
 * //add the following defines to your code globally
 * #define FIFO_SIZE 16
 * #define FIFO_SIZE 8
 *
 *
 *     // IfxMultican_Can_MsgObj canSrcMsgObj; // defined globally
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canSrcNode);
 *
 *  // FIFO MsgObj allocation:
 *         canMsgObjConfig.msgObjId = 0; // will allocate MsgObj 0
 *         canMsgObjConfig.msgObjCount = FIFO_SIZE/2;
 *  canMsgObjConfig.firstSlaveObjId = 1;
 *
 *         canMsgObjConfig.messageId = id; // 'id' defined gloabally
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_transmit;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = TRUE;
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canSrcMsgObj, &canMsgObjConfig);
 *     }
 *
 *     // IfxMultican_Can_MsgObj canDstMsgObj; // defined globally
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canDstNode);
 *
 *  // FIFO MsgObj allocation:
 *         canMsgObjConfig.msgObjId = FIFO_SIZE + 1; // avoid clashing with transmit FIFO message objects
 *         canMsgObjConfig.msgObjCount = FIFO_SIZE;
 *
 *  canMsgObjConfig.firstSlaveObjId = FIFO_SIZE + 2;
 *
 *         canMsgObjConfig.messageId = id; // 'id' defined gloabally
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_receive;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = TRUE;
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canDstMsgObj, &canMsgObjConfig);
 *     }
 * \endcode
 *
 * Data can now be sent and received with the IfxMultican_Can_MsgObj_sendMessage and IfxMultican_Can_MsgObj_readMessage functions as usual (see above).
 *
 * here is a transmit example
 * \code
 *     IfxMultican_Message txMsg;
 *     for (i = 0; i < FIFO_SIZE; ++i)
 *     {
 *         // Transmit Data from the source message object //
 *
 *         IfxMultican_Message_init(&txMsg, id, dataLow + i, dataHigh + i, IfxMultican_DataLengthCode_8);
 *
 *         while( IfxMultican_Can_MsgObj_sendMessage(&canSrcMsgObj, &txMsg) == IfxMultican_Status_notSentBusy );
 *     }
 * \endcode
 *
 * data can be read by the following way
 * \code
 *     IfxMultican_Message rxMsg;
 *     for (i = 0; i < FIFO_SIZE; ++i)
 *     {
 *         // Receiving Data, read the data from the destination receive Fifo //
 *         // wait until MCAN received the frame
 *         // wait until Multican received a new message
 *         while( !IfxMultican_Can_MsgObj_isRxPending(&canDstMsgObj) );
 *
 *
 *         IfxMultican_Message_init(&rxMsg, 0xdead, 0xdeadbeef, 0xdeadbeef, IfxMultican_DataLengthCode_8); // start with invalid values
 *
 *         IfxMultican_Status readStatus = IfxMultican_Can_MsgObj_readMessage(&canDstMsgObj, &rxMsg);
 *     }
 * \endcode
 *
 *
 * \section IfxLld_Multican_Can_FDDataTransfers CAN FD Data Transfers
 *
 * The CAN driver provides simple to use FD transfer functions
 * After initialising the module, choose the node initialisation as the following
 * Node configuration:
 * \code
 *     // create CAN node config
 *     IfxMultican_Can_NodeConfig canNodeConfig;
 *     IfxMultican_Can_Node_initConfig(&canNodeConfig, &can);
 *
 *     canNodeConfig.baudrate = 1000000; // 1 MBaud
 *
 *     // Source Node
 *     // IfxMultican_Can_Node canSrcNode; // defined globally
 *     {
 *         canNodeConfig.nodeId = IfxMultican_NodeId_0;
 *         canNodeConfig.rxPin = &IfxMultican_RXD0B_P20_7_IN;
 *         canNodeConfig.rxPinMode = IfxPort_InputMode_pullUp;
 *         canNodeConfig.txPin = &IfxMultican_TXD0_P20_8_OUT;
 *         canNodeConfig.txPinMode = IfxPort_OutputMode_pushPull;
 *
 *         // choose CAN FD transfer enable or disable //
 *         canNodeConfig.flexibleDataRate               = TRUE;
 *
 *         // if CAN FD enabled choose the FD configuration //
 *         canNodeConfig.fdConfig.nominalBaudrate       = 500000;
 *         canNodeConfig.fdConfig.nominalSynchJumpWidth = 8000;
 *         canNodeConfig.fdConfig.nominalSamplePoint    = 2000;
 *         canNodeConfig.fdConfig.fastBaudrate          = 1000000;
 *         canNodeConfig.fdConfig.fastSynchJumpWidth    = 8000;
 *         canNodeConfig.fdConfig.fastSamplePoint       = 2000;
 *         canNodeConfig.fdConfig.loopDelayOffset       = 0;
 *
 *         // initialise the node
 *         IfxMultican_Can_Node_init(&canSrcNode, &canNodeConfig);
 *     }
 *
 *     // Destination Node
 *     // IfxMultican_Can_Node canDstNode; // defined globally
 *     {
 *         canNodeConfig.nodeId = IfxMultican_NodeId_1;
 *         canNodeConfig.rxPin = IfxMultican_RXD1B_P14_1_IN;
 *         canNodeConfig.rxPinMode = IfxPort_InputMode_pullUp;
 *         canNodeConfig.txPin = IfxMultican_TXD1_P14_0_OUT;
 *         canNodeConfig.txPinMode = IfxPort_OutputMode_pushPull;
 *
 *         // choose CAN FD transfer enable or disable //
 *         config->flexibleDataRate               = TRUE;
 *
 *         // if CAN FD enabled choose the FD configuration //
 *         canNodeConfig.fdConfig.nominalBaudrate       = 500000;
 *         canNodeConfig.fdConfig.nominalSynchJumpWidth = 8000;
 *         canNodeConfig.fdConfig.nominalSamplePoint    = 2000;
 *         canNodeConfig.fdConfig.fastBaudrate          = 1000000;
 *         canNodeConfig.fdConfig.fastSynchJumpWidth    = 8000;
 *         canNodeConfig.fdConfig.fastSamplePoint       = 2000;
 *         canNodeConfig.fdConfig.loopDelayOffset       = 0;
 *
 *         // initialise the node
 *         IfxMultican_Can_Node_init(&canDstNode, &canNodeConfig);
 *     }
 * \endcode
 *
 * The CAN FD message objects initialisation can be done as followed:
 *
 * \code
 *     // IfxMultican_Can_MsgObj canSrcMsgObj; // defined globally
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canSrcNode);
 *
 *  // assigned message object:
 *         canMsgObjConfig.msgObjId = 0;
 *
 *         canMsgObjConfig.messageId = id;  // 'id' defined gloabally
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_transmit;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_64;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = TRUE;
 *
 *         canMsgObjConfig.control.topMsgObjId         = 250;
 *         canMsgObjConfig.control.bottomMsgObjId      = 251;
 *         canMsgObjConfig.control.fastBitRate         = FALSE; // fast bit rate enable/disable
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canSrcMsgObj, &canMsgObjConfig);
 *     }
 *
 *     // IfxMultican_Can_MsgObj canDstMsgObj; // defined globally
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canDstNode);
 *
 *         // assigned message object:
 *         canMsgObjConfig.msgObjId = 1;
 *
 *         canMsgObjConfig.messageId = id;
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_receive;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_64;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = TRUE;
 *
 *         canMsgObjConfig.control.topMsgObjId         = 252;
 *         canMsgObjConfig.control.bottomMsgObjId      = 253;
 *         canMsgObjConfig.control.fastBitRate         = FALSE; // fast bit rate enable/disable
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canDstMsgObj, &canMsgObjConfig);
 *     }
 * \endcode
 *
 *
 * In case of standard messages, data can be sent and received with the IfxMultican_Can_MsgObj_sendMessage and IfxMultican_Can_MsgObj_readMessage functions as usual (see above).
 *
 * In case of long frames of length more than 8 bytes
 * the data can be sent in the following way
 *
 * \code
 *     // load txData buffer with the data that needs to be send
 *     // txData is assumed to be declared globally
 *     int i;
 *     for (i = 0; i < 16; ++i)
 *     {
 *          //  uint32 txData[16]; // defined globally
 *   txData[i] = (0x11110000 + i);
 *     }
 *
 *     // Initialise the message strcture
 *     IfxMultican_Message txMsg;
 *     IfxMultican_Message_longFrameInit(&txMsg, id, IfxMultican_DataLengthCode_64, FALSE);
 *
 *     // Transmit Data
 *     while( IfxMultican_Can_MsgObj_sendlongFrame(&canSrcMsgObj, &txMsg, txData) == IfxMultican_Status_notSentBusy );
 * \endcode
 *
 * You can recieve the data by the following way
 *
 * \code
 *     // Receiving Data
 *
 *     // Initialise the message strcture with dummy values, will be replaced by the received values
 *     IfxMultican_Message rxMsg;
 *     IfxMultican_Message_longFrameInit(&rxMsg, 0xdead, IfxMultican_DataLengthCode_64, FALSE); // start with invalid values
 *
 *     // wait until Multican received a new message
 *     while( !IfxMultican_Can_MsgObj_isRxPending(&canDstMsgObj) );
 *
 *
 *     // read the message
 *     //uint32 rxData[16]; //defined globally
 *     IfxMultican_Status readStatus = IfxMultican_Can_MsgObj_readLongFrame(&canDstMsgObj, &rxMsg, rxData);
 *
 *     // if no new data is been received report an error
 *     if( !( readStatus & IfxMultican_Status_newData ) )  {
 *         clib_ver_printf("ERROR: IfxMultican_Can_MsgObj_readMessage returned 0x%04x\n", readStatus);
 *     }
 *     // if a new data is been received but one lost, report the status
 *     if( readStatus == IfxMultican_Status_newDataButOneLost )  {
 *         clib_ver_printf(" IfxMultican_Can_MsgObj_readMessage returned 0x%04x\n", readStatus);
 *     }
 *
 *     // clear pending flag
 *     IfxMultican_Can_MsgObj_clearRxPending(&canDstMsgObj);
 *
 *     // data will be available at rxData
 * \endcode
 *
 *
 * \section IfxLld_Multican_Can_GatewayTransfers Gateway Transfers
 * After initialising th emodule and nodes, the gateway message objects can be initialised in the following way
 *
 * A Gateway transfers can be enabled during the message object configuration by specifing with the canMsgObjConfig.gatewayTransfersEnable item.
 *
 * Here a configuration example:
 * \code
 *     // source message object
 *     // IfxMultican_Can_MsgObj canSrcMsgObj;  // defined globally
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canSrcNode);
 *
 *         canMsgObjConfig.msgObjId = 0;
 *         canMsgObjConfig.messageId = id; // 'id' defined globally
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_transmit;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = TRUE;
 *  canMsgObjConfig.gatewayTransfers    = FALSE;
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canSrcMsgObj, &canMsgObjConfig);
 *     }
 *
 *     // gateway source message object //
 *     // data will be received into this object from SrcObj, and then copied into gateway destination object //
 *     IfxMultican_Can_MsgObj canGatewaySrcMsgObj;
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canDstNode);
 *
 *         canMsgObjConfig.msgObjId = 1;
 *         canMsgObjConfig.messageId = id;
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_receive;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = TRUE;
 *  canMsgObjConfig.gatewayTransfers                 = TRUE;
 *         canMsgObjConfig.gatewayConfig.copyDataLengthCode = TRUE;
 *         canMsgObjConfig.gatewayConfig.copyData           = TRUE;
 *         canMsgObjConfig.gatewayConfig.copyId             = FALSE;
 *         canMsgObjConfig.gatewayConfig.enableTransmit     = TRUE;  // if this is not choosen, then no need to initialise canDstMsgObj to read the final data
 *  canMsgObjConfig.gatewayConfig.gatewayDstObjId     = 3;    // specify the destination object number
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canGatewaySrcMsgObj, &canMsgObjConfig);
 *     }
 *
 *     // gateway destination object //
 *     // data, id , datlength code will be copied from GatewaySrcObj into this object through gateway transfers //
 *     // and then sent onto the bus for sending the message to destination message object //
 *     IfxMultican_Can_MsgObj canGatewayDstMsgObj;
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canSrcNode);
 *
 *         canMsgObjConfig.msgObjId = 3;
 *         canMsgObjConfig.messageId = 0x200;
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_transmit;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = TRUE;
 *  canMsgObjConfig.gatewayTransfers   = FALSE;
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canGatewayDstMsgObj, &canMsgObjConfig);
 *     }
 *
 *     // destination message object, not needed if  enableTransmit is not chosen in gateway source object, or you don't want to read the data//
 *     // data will be received from GatewayDstObj into this obj //
 *     // IfxMultican_Can_MsgObj canDstMsgObj;      // defined globally
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canDstNode);
 *
 *         canMsgObjConfig.msgObjId = 10;
 *         canMsgObjConfig.messageId = 0x200;
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_receive;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = FALSE;
 *  canMsgObjConfig.gatewayTransfers                 = FALSE;
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canDstMsgObj, &canMsgObjConfig);
 *     }
 * \endcode
 *
 * Data can now be sent and received with the IfxMultican_Can_MsgObj_sendMessage and IfxMultican_Can_MsgObj_readMessage functions as usual (see above).
 *
 * The data flow is as followed,
 *
 * Data will be sent from the source object (canSrcMsgObj), it will be received by the gateway source object (canGatewaySrcMsgObj).
 * and then gets copied into the gateway destination object (canGatewayDstMsgObj) without CPU intervention,
 *
 * If GDFS is selected in gateway source object (canGatewaySrcMsgObj)then,
 * the data will be transmitted from gateway destination object(canGatewayDstMsgObj) to the destination object (canDstMsgObj)
 *
 * \section IfxLld_Multican_Can_Gateway_Fifo_Transfers Gateway FIFO based Transfers
