realsosy/InfineonRacer/2_src/InfineonRacer_TC23xA/0_Src/4_McHal/Tricore/Multican/Can/IfxMultican_Can.h
 * After initialising the module and nodes,
 *
 * A gateway FIFO transfers can be enabled during the node configuration by specifing the number of allocated message objects with the canMsgObjConfig.msgObjCount item.
 * and enbling the gateway transfers with the canMsgObjConfig.gatewayTransfersEnable item. and also by selecting the start object of the FIFO with the
 * canMsgObjConfig.firstSlaveObjId item.
 *
 * Message objects will be allocated to the gateway FIFO in ascending order.
 * Here a configuration example:
 * \code
 *     // source message object, you can even make it as a Tx FIFO
 *     // IfxMultican_Can_MsgObj canSrcMsgObj;    // defined globally
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canSrcNode);
 *
 *         canMsgObjConfig.msgObjId = 0;
 *         canMsgObjConfig.messageId = id;
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_transmit;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = TRUE;
 *  canMsgObjConfig.gatewayTransfers   = FALSE;
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canSrcMsgObj, &canMsgObjConfig);
 *     }
 *
 *     // gateway source Fifo //
 *     // data will be received into this object from SrcObj, and then copied into gateway Fifo objects //
 *     IfxMultican_Can_MsgObj canGatewaySrcMsgObj;
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canDstNode);
 *
 *         canMsgObjConfig.msgObjId = 1;
 *         canMsgObjConfig.messageId = id;
 *  canMsgObjConfig.msgObjCount = 4;    // FIFO
 *  canMsgObjConfig.firstSlaveObjId = 2;  // will allocate MsgObj 2..5 for the gateway FIFO
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_receive;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = TRUE;
 *  canMsgObjConfig.gatewayTransfers                 = TRUE;  // gateway FIFO
 *         canMsgObjConfig.gatewayConfig.copyDataLengthCode = TRUE;
 *         canMsgObjConfig.gatewayConfig.copyData           = TRUE;
 *         canMsgObjConfig.gatewayConfig.copyId             = FALSE;
 *         canMsgObjConfig.gatewayConfig.enableTransmit     = TRUE;
 *
 *
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canGatewaySrcMsgObj, &canMsgObjConfig);
 *     }
 *
 *     int i  = 0;
 *     for (i = 0; i < 4 ; ++i)
 *     {
 *  // gateway destination objects //
 *  // data, id , datlength code will be copied from GatewaySrcObj into this object through gateway transfers //
 *      // and then sent onto the bus for sending the message to destination receive Fifo message objects //
 *         IfxMultican_Can_MsgObj canGatewayDstMsgObj;
 *         {
 *             // create message object config
 *             IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *             IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canSrcNode);
 *
 *             canMsgObjConfig.msgObjId = 2 + i;
 *             canMsgObjConfig.messageId = 0x200;
 *             canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *             canMsgObjConfig.frame = IfxMultican_Frame_transmit;
 *             canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *             canMsgObjConfig.control.extendedFrame = FALSE;
 *             canMsgObjConfig.control.matchingId = FALSE;
 *          canMsgObjConfig.gatewayTransfers   = FALSE;
 *
 *             // initialize message object
 *             IfxMultican_Can_MsgObj_init(&canGatewayDstMsgObj, &canMsgObjConfig);
 *         }
 *     }
 *     // destination receive Fifo,
 *     // data will be received from GatewayDstObj into this Fifo //
 *     // IfxMultican_Can_MsgObj canDstMsgObj;    // defined globally
 *     {
 *         // create message object config
 *         IfxMultican_Can_MsgObjConfig canMsgObjConfig;
 *         IfxMultican_Can_MsgObj_initConfig(&canMsgObjConfig, &canDstNode);
 *
 *         canMsgObjConfig.msgObjId = 10;
 *         canMsgObjConfig.messageId = 0x200;
 *  canMsgObjConfig.msgObjCount = 4;   // receive FIFO
 *  canMsgObjConfig.firstSlaveObjId  = 11;   // will allocate MsgObj 11..14 for the receive FIFO
 *         canMsgObjConfig.acceptanceMask = 0x7FFFFFFFUL;
 *         canMsgObjConfig.frame = IfxMultican_Frame_receive;
 *         canMsgObjConfig.control.messageLen = IfxMultican_DataLengthCode_8;
 *         canMsgObjConfig.control.extendedFrame = FALSE;
 *         canMsgObjConfig.control.matchingId = FALSE;
 *  canMsgObjConfig.gatewayTransfers  = FALSE;
 *  canMsgObjConfig.firstSlaveObjId  = 11;
 *
 *
 *         // initialize message object
 *         IfxMultican_Can_MsgObj_init(&canDstMsgObj, &canMsgObjConfig);
 *     }
 * \endcode
 *
 * Data can now be sent and received with the IfxMultican_Can_MsgObj_sendMessage and IfxMultican_Can_MsgObj_readMessage functions as usual (see above).
 * here is a transmit example
 * \code
 *     for (i = 0; i < 4; ++i)
 *     {
 *         // Transmit Data from the source message object //
 *         IfxMultican_Message txMsg;
 *         IfxMultican_Message_init(&txMsg, id, dataLow + i, dataHigh + i, IfxMultican_DataLengthCode_8);
 *
 *         while( IfxMultican_Can_MsgObj_sendMessage(&canSrcMsgObj, &txMsg) == IfxMultican_Status_notSentBusy );
 *     }
 * \endcode
 *
 * The data flow is as followed,
 *
 * data will be sent from the source object (canSrcMsgObj) or source TX FIFO, it will be received by the gateway source FIFO (canGatewaySrcMsgObj).
 * and then gets copied into the gateway destination objects (canGatewayDstMsgObj) without CPU intervention,
 *
 * If GDFS is selected in gateway source object (FIFO) (canGatewaySrcMsgObj)then,
 * the data will be transmitted from gateway destination objects (canGatewayDstMsgObj) to the destination objects or receive FIFO (canDstMsgObj)
 *
 * data can be read by the following way
 * \code
 *     for (i = 0; i < 4; ++i)
 *     {
 *         // Receiving Data, read the data from the destination receive Fifo //
 *         // wait until MCAN received the frame
 *         // wait until Multican received a new message
 *         while( !IfxMultican_Can_MsgObj_isRxPending(&canDstMsgObj) );
 *
 *         IfxMultican_Message rxMsg;
 *         IfxMultican_Message_init(&rxMsg, 0xdead, 0xdeadbeef, 0xdeadbeef, IfxMultican_DataLengthCode_8); // start with invalid values
 *
 *         IfxMultican_Status readStatus = IfxMultican_Can_MsgObj_readMessage(&canDstMsgObj, &rxMsg);
 *
 *         // if no new data is been received report an error
 *         if( !( readStatus & IfxMultican_Status_newData ) )  {
 *             clib_ver_printf("ERROR: IfxMultican_Can_MsgObj_readMessage returned 0x%04x\n", readStatus);
 *         }
 *         // if a new data is been received but one lost, report the status
 *         if( readStatus == IfxMultican_Status_newDataButOneLost )  {
 *             clib_ver_printf(" IfxMultican_Can_MsgObj_readMessage returned 0x%04x\n", readStatus);
 *         }
 *     }
 * \endcode
 *
 * \defgroup IfxLld_Multican_Can CAN
 * \ingroup IfxLld_Multican
 * \defgroup IfxLld_Multican_Can_Data_Structures Data structures
 * \ingroup IfxLld_Multican_Can
 * \defgroup IfxLld_Multican_Can_General General functions
 * \ingroup IfxLld_Multican_Can
 * \defgroup IfxLld_Multican_Can_Node CAN Nodes
 * \ingroup IfxLld_Multican_Can
 * \defgroup IfxLld_Multican_Can_Message_Objects Message Objects
 * \ingroup IfxLld_Multican_Can
 * \defgroup IfxLld_Multican_Can_Interrupts Interrupts
 * \ingroup IfxLld_Multican_Can
 */

#ifndef IFXMULTICAN_CAN_H
#define IFXMULTICAN_CAN_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "Multican/Std/IfxMultican.h"
#include "Scu/Std/IfxScuCcu.h"
#include "IfxScu_regdef.h"

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

