realsosy/InfineonRacer/2_src/InfineonRacer_TC23xA/0_Src/4_McHal/Tricore/Multican/Can/IfxMultican_Can.h
/** \addtogroup IfxLld_Multican_Can_Data_Structures
 * \{ */
/** \brief Structure for CAN FD configuration
 */
typedef struct
{
    uint32 nominalBaudrate;           /**< \brief Specifies the FD nominal baudrate (Nominal Bit Rate) */
    uint16 nominalSynchJumpWidth;     /**< \brief Specifies the FD nominal resynchronisation jump width. Range = [0, 10000] resp. [0%, 100%] of the total nominal bit time */
    uint16 nominalSamplePoint;        /**< \brief Specifies the FD nominal sample point. Range = [0, 10000] resp. [0%, 100%] of the total bit time */
    uint32 fastBaudrate;              /**< \brief Specifies the FD fast baudrate (Data Bit rate) */
    uint16 fastSynchJumpWidth;        /**< \brief Specifies the FD fast resynchronisation jump width. Range = [0, 10000] resp. [0%, 100%] of the total fast bit time */
    uint16 fastSamplePoint;           /**< \brief Specifies the FD fast sample point. Range = [0, 10000] resp. [0%, 100%] of the total bit time */
    uint16 loopDelayOffset;           /**< \brief Specifies the transceiver delay ompensation offset that is added to the measured transceiver delay. Range = [0, 15] */
} IfxMultican_Can_FdConfig;

/** \brief Structure for gateway configuration
 */
typedef struct
{
    uint32               copyDataLengthCode : 1;   /**< \brief Specifies the choice for copying data length code */
    uint32               copyData : 1;             /**< \brief Specifies the choice for copying data (data low and data high) */
    uint32               copyId : 1;               /**< \brief Specifies the choice for copying id of the message */
    uint32               enableTransmit : 1;       /**< \brief Specifies the enable choice of TXRQ in the destination gateway object (GDFS of source gateway object) */
    IfxMultican_MsgObjId gatewayDstObjId;          /**< \brief Message object number of first slave object (bottom pointer) */
} IfxMultican_Can_GatewayConfig;

/** \brief Structure for interrupt configuration
 */
typedef struct
{
    uint16     priority;          /**< \brief interrupt priority */
    IfxSrc_Tos typeOfService;     /**< \brief type of interrupt service */
} IfxMultican_Can_InterruptConfig;

/** \brief Structure for interrupt source
 */
typedef struct
{
    boolean           enabled;     /**< \brief If true, enables the interrupt generation */
    IfxMultican_SrcId srcId;       /**< \brief interrupt node pointer used */
} IfxMultican_Can_InterruptSource;

/** \brief Message object control
 */
typedef struct
{
    uint32                     singleDataTransfer : 1;    /**< \brief Specifies the single data transfer option. If 1, single data transfer is selected */
    uint32                     singleTransmitTrial : 1;   /**< \brief Specifies the single transmit trial option. If 1, single transmit trial is selected */
    IfxMultican_DataLengthCode messageLen;                /**< \brief Specifies the length of the transmited data (number of bytes). This value is ignored for receive object */
    uint32                     extendedFrame : 1;         /**< \brief Specifies the standard / extended frame mode. 0: standard frame 11 bit ID; 1: extended frame 29 bit ID */
    uint32                     matchingId : 1;            /**< \brief Specifies the acceptance mask. 0: standard & extended frame (11 & 29 bit); 1: only frames with maching IDE */
    IfxMultican_MsgObjId       topMsgObjId;               /**< \brief Specifies the ID of the message object with data byte 8 to 35. (CAN FD) */
    IfxMultican_MsgObjId       bottomMsgObjId;            /**< \brief Specifies the ID of the message object with data byte 36 to 63. (CAN FD) */
    uint32                     fastBitRate : 1;           /**< \brief Specifies the bit rate switch. 0: nominal bit rate ; 1: fast bit rate */
} IfxMultican_Can_MsgObjControl;

/** \brief CAN node handle data structure
 */
typedef struct
{
    Ifx_CAN           *mcan;         /**< \brief Specifies the pointer to the MULTICAN module registers */
    Ifx_CAN_N         *node;         /**< \brief Specifies the pointer to the MULTICAN node registers */
    IfxMultican_NodeId nodeId;       /**< \brief Specifies the node Id */
    boolean            fastNode;     /**< \brief CAN FD fast node enable/disable */
} IfxMultican_Can_Node;

/** \} */

/** \addtogroup IfxLld_Multican_Can_Data_Structures
 * \{ */
/** \brief CAN handle data structure
 */
typedef struct
{
    Ifx_CAN *mcan;     /**< \brief Specifies the pointer to the MULTICAN module registers */
} IfxMultican_Can;

/** \brief CAN module configuration
 */
typedef struct
{
    Ifx_CAN                        *module;                               /**< \brief pointer to MULTICAN module */
    IfxMultican_ClockSelect         clockSelect;                          /**< \brief Selected module input clock */
    float32                         moduleFreq;                           /**< \brief Required module frequency in Hertz */
    IfxMultican_Can_InterruptConfig nodePointer[IFXMULTICAN_NUM_SRC];     /**< \brief Node pointer configuration */
} IfxMultican_Can_Config;

/** \brief CAN message object handle data structure
 */
typedef struct
{
    IfxMultican_Can_Node *node;            /**< \brief Specifies the pointer to the node handle */
    IfxMultican_MsgObjId  msgObjId;        /**< \brief Specifies the message object ID */
    uint16                msgObjCount;     /**< \brief Number of message object sto be initialised (1 for standard Msg Obj and no. of objects including base object for FIFO transfers) */
    IfxMultican_MsgObjId  fifoPointer;     /**< \brief Pointer for FIFO based transfers */
} IfxMultican_Can_MsgObj;

/** \brief CAN message object configuration
 */
typedef struct
{
    IfxMultican_Can_Node           *node;                   /**< \brief Specifies the pointer to the node handle */
    IfxMultican_MsgObjId            msgObjId;               /**< \brief Specifies the message object ID */
    uint16                          msgObjCount;            /**< \brief Number of message object sto be initialised (1 for standard Msg Obj and no. of objects including base object for FIFO transfers) */
    IfxMultican_Can_MsgObjControl   control;                /**< \brief Message object control */
    IfxMultican_Frame               frame;                  /**< \brief Specifies the frame type */
    uint32                          acceptanceMask;         /**< \brief Specifies the acceptance mask */
    uint32                          messageId;              /**< \brief Specifies the message ID */
    IfxMultican_Priority            priority;               /**< \brief Specifies the message object priority */
    IfxMultican_Can_InterruptSource rxInterrupt;            /**< \brief Rx Interrupt configuration */
    IfxMultican_Can_InterruptSource txInterrupt;            /**< \brief Tx Interrupt configuration */
    uint32                          gatewayTransfers : 1;   /**< \brief Specifies the gateway source object (gateway transfres enable / disable choice) */
    IfxMultican_Can_GatewayConfig   gatewayConfig;          /**< \brief Structure for gateway configuration */
    IfxMultican_MsgObjId            firstSlaveObjId;        /**< \brief Message object number of first slave object (bottom pointer) */
} IfxMultican_Can_MsgObjConfig;

/** \brief CAN Node configuration
 */
typedef struct
{
    Ifx_CAN                        *module;                     /**< \brief pointer to MULTICAN module */
    IfxMultican_NodeId              nodeId;                     /**< \brief Specifies the node Id */
    boolean                         analyzerMode;               /**< \brief Specifies the analizer mode. If TRUE then the CAN Node works in analizer mode */
    boolean                         loopBackMode;               /**< \brief Specifies the loop back mode. If TRUE then the CAN Node works in loop back mode */
    uint32                          baudrate;                   /**< \brief Specifies the baudrate */
    uint16                          samplePoint;                /**< \brief Specifies the sample point. Range = [0, 10000] resp. [0%, 100%] of the total bit time */
    uint16                          synchJumpWidth;             /**< \brief Specifies the resynchronisation jump width. Range = [0, 10000] resp. [0%, 100%] of the total bit time */
    boolean                         flexibleDataRate;           /**< \brief CANFD enable/disable */
    IfxMultican_Can_FdConfig        fdConfig;                   /**< \brief Specifies CAN FD configuration */
    IfxMultican_Rxd_In             *rxPin;                      /**< \brief Specifies the receive pin */
    IfxPort_InputMode               rxPinMode;                  /**< \brief Specifies the receive pin as input mode */
    IfxMultican_Txd_Out            *txPin;                      /**< \brief Specifies the transmit pin */
    IfxPort_OutputMode              txPinMode;                  /**< \brief Specifies the transmit pin output mode */
    uint8                           errorWarningLevel;          /**< \brief Specifies the error warinig level */
    IfxMultican_Can_InterruptSource transferInterrupt;          /**< \brief Transfer interrupt */
    IfxMultican_Can_InterruptSource lastErrorCodeInterrupt;     /**< \brief Last error code interrupt */
    IfxMultican_Can_InterruptSource alertInterrupt;             /**< \brief Alert interrupt */
    IfxMultican_Can_InterruptSource frameCounterInterrupt;      /**< \brief Frame counter interrupt */
    IfxMultican_Can_InterruptSource timerInterrupt;             /**< \brief Timer Interrupt */
} IfxMultican_Can_NodeConfig;

